# Week 4 Lab: Data Visualization with DBT and Superset

During this week's lab, you will learn how to create analytical views and a dashboard.

# Table of Contents

- [ 1 - Introduction and Setup](#1)
- [ 2 - Views with dbt](#2)
  - [ 2.1 - Annual Sales per Office](#2.1)
  - [ 2.2 - Average Sales per Product Line](#2.2)
  - [ 2.3 - Running Analytical Views](#2.3)
  - [ 2.4 - Creating Materialized View](#2.4)
- [ 3 - Dashboard with Apache Superset](#3)

Load the SQL extension.

In [1]:
%load_ext sql

<a name='1'></a>
## 1 - Introduction and Setup

Data visualization is a critical skill for a Data Engineer, enabling you to transform complex data sets into insightful, actionable visuals. Effective visual communication can enhance understanding of the insights you gained while processing data, uncover trends, and drive strategic actions in any data-centric organization. In this lab, you will use a star schema model created on top of the `classicmodels` dataset, you will create analytical views on top of this model and then display the results in a dashboard using Apache Superset.

**dbt** is a transformation workflow command line tool based on SQL, you have worked with dbt before and the initial project is similar to the one done for the assignment of the first week of this course.

Let's start the `dbt` project called `classicmodels_modeling`.

*Note*:<span style="color:red"> All terminal commands in this lab should be run in the VSCode terminal, not Jupyter, as it may cause some issues. Always check that the virtual environment is active.</span>

1.1.1. Activate the Python virtual environment for the lab. Run the following command in the VSCode terminal:
```bash
source jupyterlab-venv/bin/activate
```

1.1.2. Check that `dbt` Core is installed.

```bash
dbt --version
```

1.1.3. Go to AWS console, and in the CloudFormation Outputs tab find the key `PostgresEndpoint`. Copy the corresponding **Value**.

1.1.4. Open the file located at `./scripts/profiles.yml`. Replace the placeholders `<DATABASE_ENDPOINT>` with the endpoint value. Save changes.

1.1.5. Run the following command to copy the `profiles.yml` file to the invisible folder `.dbt` of the project:

```bash
cp ./scripts/profiles.yml $HOME/.dbt/profiles.yml 
```

1.1.6. Navigate into your project's directory:

```bash
cd classicmodels_modeling
```

1.1.7. Run the following command to test the connection:

```bash
dbt debug
```

It should return a `Connection test: OK connection ok` at the end of the output.

1.1.8. Run the following command to fetch the latest stable versions of tools and libraries specified in the `packages.yml` file.

```bash
dbt deps
```

1.1.9. Load the source configuration into the notebook with the following code:

In [2]:
import yaml

with open("./scripts/profiles.yml", 'r') as stream:
    data_loaded = yaml.safe_load(stream)
    
DBCONFIG = data_loaded["classicmodels_modeling"]["outputs"]["source"]
DBHOST = DBCONFIG["host"]
DBPORT = int(DBCONFIG["port"])
DBNAME = DBCONFIG["dbname"]
DBUSER = DBCONFIG["user"]
DBPASSWORD = DBCONFIG["password"]
db_connection_url = f'postgresql+psycopg2://{DBUSER}:{DBPASSWORD}@{DBHOST}:{DBPORT}/{DBNAME}'

%sql {db_connection_url}

1.1.10. Test the connection from the Notebook to the Postgres database. You should see the schemas of the database in the output.

In [3]:
%%sql

SELECT schema_name
FROM information_schema.schemata;

 * postgresql+psycopg2://postgresuser:***@de-c4w4lab1-rds.c7462saomovv.us-east-1.rds.amazonaws.com:5432/postgres
4 rows affected.

[('public',), ('classicmodels',), ('information_schema',), ('pg_catalog',)]

1.1.11. Run the star schema models in the VSCode terminal (make sure that you are still in the project directory `classicmodels_modeling`):

```bash
dbt run
```

You should see a similar output to the run command:

```bash
Finished running 7 table models in 0 hours 0 minutes and 1.xx seconds (1.xx s).

Completed successfully

Done. PASS=7 WARN=0 ERROR=0 SKIP=0 TOTAL=7
```

1.1.12. Verify that the star schema was added to the Postgres database, the new schema should be called `classicmodels_star_schema`:

In [4]:
%%sql

SELECT schema_name
FROM information_schema.schemata;

 * postgresql+psycopg2://postgresuser:***@de-c4w4lab1-rds.c7462saomovv.us-east-1.rds.amazonaws.com:5432/postgres
5 rows affected.

[('public',),
 ('classicmodels_star_schema',),
 ('classicmodels',),
 ('information_schema',),
 ('pg_catalog',)]

1.1.13. Now, let's verify that the star schema fact and dimensional tables are available in the new schema. Run the following cell:

In [5]:
%%sql
SELECT table_catalog, table_schema, table_name, table_type  FROM information_schema.tables 
WHERE table_schema = 'classicmodels_star_schema'

 * postgresql+psycopg2://postgresuser:***@de-c4w4lab1-rds.c7462saomovv.us-east-1.rds.amazonaws.com:5432/postgres
7 rows affected.

[('postgres', 'classicmodels_star_schema', 'dim_dates', 'BASE TABLE'),
 ('postgres', 'classicmodels_star_schema', 'dates', 'BASE TABLE'),
 ('postgres', 'classicmodels_star_schema', 'dim_customers', 'BASE TABLE'),
 ('postgres', 'classicmodels_star_schema', 'dim_employees', 'BASE TABLE'),
 ('postgres', 'classicmodels_star_schema', 'dim_offices', 'BASE TABLE'),
 ('postgres', 'classicmodels_star_schema', 'dim_products', 'BASE TABLE'),
 ('postgres', 'classicmodels_star_schema', 'fact_orders', 'BASE TABLE')]

Verify that each table has data and their columns names and types.

In [6]:
%sql SELECT * FROM classicmodels_star_schema.fact_orders LIMIT 10

 * postgresql+psycopg2://postgresuser:***@de-c4w4lab1-rds.c7462saomovv.us-east-1.rds.amazonaws.com:5432/postgres
10 rows affected.

[('1f8f31c7d43a69e00bff8264109eeb4c', '00411460f7c92d2124a67ea0f4cb5f85', '3948ead63a9f2944218de038d8934305', 'c81e728d9d4c2f636f067f89cc14862c', 'f95ed59fd3313855e03af1b96334e685', datetime.datetime(2003, 1, 6, 0, 0), datetime.datetime(2003, 1, 13, 0, 0), datetime.datetime(2003, 1, 10, 0, 0), 30, Decimal('136')),
 ('98242fbce3c533a4ae5827f13142af23', '00411460f7c92d2124a67ea0f4cb5f85', '3948ead63a9f2944218de038d8934305', 'c81e728d9d4c2f636f067f89cc14862c', 'e99d5f4747d9abb3e4148d0317dac3df', datetime.datetime(2003, 1, 6, 0, 0), datetime.datetime(2003, 1, 13, 0, 0), datetime.datetime(2003, 1, 10, 0, 0), 50, Decimal('55.09')),
 ('3b73bc66e4119eacbc3c63eaf4608548', '00411460f7c92d2124a67ea0f4cb5f85', '3948ead63a9f2944218de038d8934305', 'c81e728d9d4c2f636f067f89cc14862c', '429d1bfa2660c76daf6d27f99e10c40e', datetime.datetime(2003, 1, 6, 0, 0), datetime.datetime(2003, 1, 13, 0, 0), datetime.datetime(2003, 1, 10, 0, 0), 22, Decimal('75.46')),
 ('969259c8f1be79a73de9014d18c56827', '00411460f7c92d2124a67ea0f4cb5f85', '3948ead63a9f2944218de038d8934305', 'c81e728d9d4c2f636f067f89cc14862c', '62b141855439f4ba3f52036409a9fd14', datetime.datetime(2003, 1, 6, 0, 0), datetime.datetime(2003, 1, 13, 0, 0), datetime.datetime(2003, 1, 10, 0, 0), 49, Decimal('35.29')),
 ('85fc329e6a3e29d44ae81fd0f0809edf', '76dc611d6ebaafc66cc0879c71b5db5c', '49b8b4f95f02e055801da3b4f58e28b7', '8f14e45fceea167a5a36dedd4bea2543', 'ef8e0274836db61155b2f6329206ffb6', datetime.datetime(2003, 1, 9, 0, 0), datetime.datetime(2003, 1, 18, 0, 0), datetime.datetime(2003, 1, 11, 0, 0), 25, Decimal('108.06')),
 ('ba8b8ce928e516b27b249b7ab87d7eb7', '76dc611d6ebaafc66cc0879c71b5db5c', '49b8b4f95f02e055801da3b4f58e28b7', '8f14e45fceea167a5a36dedd4bea2543', '9bdf7d6aaeffea97a4ab0f562fe54026', datetime.datetime(2003, 1, 9, 0, 0), datetime.datetime(2003, 1, 18, 0, 0), datetime.datetime(2003, 1, 11, 0, 0), 26, Decimal('167.06')),
 ('18d5bb62b3a7d1e610f32b0b06f5c900', '76dc611d6ebaafc66cc0879c71b5db5c', '49b8b4f95f02e055801da3b4f58e28b7', '8f14e45fceea167a5a36dedd4bea2543', '7e1421596451e8efe4ac99cf6fc783be', datetime.datetime(2003, 1, 9, 0, 0), datetime.datetime(2003, 1, 18, 0, 0), datetime.datetime(2003, 1, 11, 0, 0), 45, Decimal('32.53')),
 ('8272d88bcb8ca0786f887b9b31e903a6', '76dc611d6ebaafc66cc0879c71b5db5c', '49b8b4f95f02e055801da3b4f58e28b7', '8f14e45fceea167a5a36dedd4bea2543', 'fb74c462a79ab6342c1a81bfb0bbd8d8', datetime.datetime(2003, 1, 9, 0, 0), datetime.datetime(2003, 1, 18, 0, 0), datetime.datetime(2003, 1, 11, 0, 0), 46, Decimal('44.35')),
 ('c5ee31aea3ebb5f4e85821ac18f1ab2d', 'fc221309746013ac554571fbd180e1c8', 'c0a271bc0ecb776a094786474322cb82', 'eccbc87e4b5ce2fe28308fd9f2a7baf3', '2f1940aaee16632276d6ba6b5b709615', datetime.datetime(2003, 1, 10, 0, 0), datetime.datetime(2003, 1, 18, 0, 0), datetime.datetime(2003, 1, 14, 0, 0), 39, Decimal('95.55')),
 ('47a313d1eb63620f42d485ac2e4da78d', 'fc221309746013ac554571fbd180e1c8', 'c0a271bc0ecb776a094786474322cb82', 'eccbc87e4b5ce2fe28308fd9f2a7baf3', 'cd0f60c4410a9de77da04fb01e74c504', datetime.datetime(2003, 1, 10, 0, 0), datetime.datetime(2003, 1, 18, 0, 0), datetime.datetime(2003, 1, 14, 0, 0), 41, Decimal('43.13'))]

In [7]:
%sql SELECT * FROM classicmodels_star_schema.dim_customers LIMIT 10

 * postgresql+psycopg2://postgresuser:***@de-c4w4lab1-rds.c7462saomovv.us-east-1.rds.amazonaws.com:5432/postgres
10 rows affected.

[('6974ce5ac660610b44d9b9fed0ff9548', 'Atelier graphique', 'Schmitt', 'Carine ', '40.32.2555', '54, rue Royale', None, '44000', 'Nantes', None, 'France', Decimal('21000')),
 ('7f6ffaa6bb0b408017b62254211691b5', 'Signal Gift Stores', 'King', 'Jean', '7025551838', '8489 Strong St.', None, '83030', 'Las Vegas', 'NV', 'USA', Decimal('71800')),
 ('5fd0b37cd7dbbb00f97ba6ce92bf5add', 'Australian Collectors, Co.', 'Ferguson', 'Peter', '03 9520 4555', '636 St Kilda Road', 'Level 3', '3004', 'Melbourne', 'Victoria', 'Australia', Decimal('117300')),
 ('07e1cd7dca89a1678042477183b7ac3f', 'La Rochelle Gifts', 'Labrune', 'Janine ', '40.67.8555', '67, rue des Cinquante Otages', None, '44000', 'Nantes', None, 'France', Decimal('118200')),
 ('4c56ff4ce4aaf9573aa5dff913df997a', 'Baane Mini Imports', 'Bergulfsen', 'Jonas ', '07-98 9555', 'Erling Skakkes gate 78', None, '4110', 'Stavern', None, 'Norway', Decimal('81700')),
 ('c8ffe9a587b126f152ed3d89a146b445', 'Mini Gifts Distributors Ltd.', 'Nelson', 'Susan', '4155551450', '5677 Strong St.', None, '97562', 'San Rafael', 'CA', 'USA', Decimal('210500')),
 ('3def184ad8f4755ff269862ea77393dd', 'Havel & Zbyszek Co', 'Piestrzeniewicz', 'Zbyszek ', '(26) 642-7555', 'ul. Filtrowa 68', None, '01-012', 'Warszawa', None, 'Poland', Decimal('0')),
 ('76dc611d6ebaafc66cc0879c71b5db5c', 'Blauer See Auto, Co.', 'Keitel', 'Roland', '+49 69 66 90 2555', 'Lyonerstr. 34', None, '60528', 'Frankfurt', None, 'Germany', Decimal('59700')),
 ('d1f491a404d6854880943e5c3cd9ca25', 'Mini Wheels Co.', 'Murphy', 'Julie', '6505555787', '5557 North Pendale Street', None, '94217', 'San Francisco', 'CA', 'USA', Decimal('64600')),
 ('1afa34a7f984eeabdbb0a7d494132ee5', 'Land of Toys Inc.', 'Lee', 'Kwai', '2125557818', '897 Long Airport Avenue', None, '10022', 'NYC', 'NY', 'USA', Decimal('114900'))]

In [8]:
%sql SELECT * FROM classicmodels_star_schema.dim_employees LIMIT 10

 * postgresql+psycopg2://postgresuser:***@de-c4w4lab1-rds.c7462saomovv.us-east-1.rds.amazonaws.com:5432/postgres
10 rows affected.

[('fba9d88164f3e2d9109ee770223212a0', 'Murphy', 'Diane', 'President', 'dmurphy@classicmodelcars.com'),
 ('4ca82782c5372a547c104929f03fe7a9', 'Patterson', 'Mary', 'VP Sales', 'mpatterso@classicmodelcars.com'),
 ('8a1e808b55fde9455cb3d8857ed88389', 'Firrelli', 'Jeff', 'VP Marketing', 'jfirrelli@classicmodelcars.com'),
 ('b1563a78ec59337587f6ab6397699afc', 'Patterson', 'William', 'Sales Manager (APAC)', 'wpatterson@classicmodelcars.com'),
 ('c667d53acd899a97a85de0c201ba99be', 'Bondur', 'Gerard', 'Sale Manager (EMEA)', 'gbondur@classicmodelcars.com'),
 ('208e43f0e45c4c78cafadb83d2888cb6', 'Bow', 'Anthony', 'Sales Manager (NA)', 'abow@classicmodelcars.com'),
 ('a3fb4fbf9a6f9cf09166aa9c20cbc1ad', 'Jennings', 'Leslie', 'Sales Rep', 'ljennings@classicmodelcars.com'),
 ('0f2c9a93eea6f38fabb3acb1c31488c6', 'Thompson', 'Leslie', 'Sales Rep', 'lthompson@classicmodelcars.com'),
 ('c44e503833b64e9f27197a484f4257c0', 'Firrelli', 'Julie', 'Sales Rep', 'jfirrelli@classicmodelcars.com'),
 ('3948ead63a9f2944218de038d8934305', 'Patterson', 'Steve', 'Sales Rep', 'spatterson@classicmodelcars.com')]

In [9]:
%sql SELECT * FROM classicmodels_star_schema.dim_offices LIMIT 10

 * postgresql+psycopg2://postgresuser:***@de-c4w4lab1-rds.c7462saomovv.us-east-1.rds.amazonaws.com:5432/postgres
7 rows affected.

[('c4ca4238a0b923820dcc509a6f75849b', '94080', 'San Francisco', 'CA', 'USA', 'NA'),
 ('c81e728d9d4c2f636f067f89cc14862c', '02107', 'Boston', 'MA', 'USA', 'NA'),
 ('eccbc87e4b5ce2fe28308fd9f2a7baf3', '10022', 'NYC', 'NY', 'USA', 'NA'),
 ('a87ff679a2f3e71d9181a67b7542122c', '75017', 'Paris', None, 'France', 'EMEA'),
 ('e4da3b7fbbce2345d7772b0674a318d5', '102-8578', 'Tokyo', 'Chiyoda-Ku', 'Japan', 'Japan'),
 ('1679091c5a880faf6fb5e6087eb1b2dc', '2010', 'Sydney', 'NSW', 'Australia', 'APAC'),
 ('8f14e45fceea167a5a36dedd4bea2543', 'EC2N 1HN', 'London', None, 'UK', 'EMEA')]

In [10]:
%sql SELECT * FROM classicmodels_star_schema.dim_products LIMIT 10

 * postgresql+psycopg2://postgresuser:***@de-c4w4lab1-rds.c7462saomovv.us-east-1.rds.amazonaws.com:5432/postgres
10 rows affected.

[('c57855c679250d9702f2557f9f8c44df', '1969 Harley Davidson Ultimate Chopper', 'Motorcycles', '1:10', 'Min Lin Diecast', 'This replica features working kickstand, front suspension, gear-shift lever, footbrake lever, drive chain, wheels and steering. All parts are particularly delicate due to their precise scale and require special care and attention.', 'Our motorcycles are state of the art replicas of classic as well as contemporary motorcycle legends such as Harley Davidson, Ducati and Vespa. Models ... (297 characters truncated) ...  out-of-production vehicles. All models come fully assembled and ready for display in the home or office. Most include a certificate of authenticity.'),
 ('0a113318bee26a2722998d59eaabd280', '1952 Alpine Renault 1300', 'Classic Cars', '1:10', 'Classic Metal Creations', 'Turnable front wheels; steering function; detailed interior; detailed engine; opening hood; opening trunk; opening doors; and detailed chassis.', 'Attention car enthusiasts: Make your wildest car ownership dreams come true. Whether you are looking for classic muscle cars, dream sports cars or mo ... (437 characters truncated) ... cles. All models include a certificate of authenticity from their manufacturers and come fully assembled and ready for display in the home or office.'),
 ('ff0f004a2bd95bc5437fda6accd38e4c', '1996 Moto Guzzi 1100i', 'Motorcycles', '1:10', 'Highway 66 Mini Classics', 'Official Moto Guzzi logos and insignias, saddle bags located on side of motorcycle, detailed engine, working steering, working suspension, two leathe ... (93 characters truncated) ... paint with chrome accents, superior die-cast detail , rotating wheels , working kick stand, diecast metal with plastic parts and baked enamel finish.', 'Our motorcycles are state of the art replicas of classic as well as contemporary motorcycle legends such as Harley Davidson, Ducati and Vespa. Models ... (297 characters truncated) ...  out-of-production vehicles. All models come fully assembled and ready for display in the home or office. Most include a certificate of authenticity.'),
 ('325a76ec55097780dea7210114a8f2fd', '2003 Harley-Davidson Eagle Drag Bike', 'Motorcycles', '1:10', 'Red Start Diecast', 'Model features, official Harley Davidson logos and insignias, detachable rear wheelie bar, heavy diecast metal with resin parts, authentic multi-colo ... (201 characters truncated) ... t replica, baked enamel finish, 1:10 scale model, removable fender, seat and tank cover piece for displaying the superior detail of the v-twin engine', 'Our motorcycles are state of the art replicas of classic as well as contemporary motorcycle legends such as Harley Davidson, Ducati and Vespa. Models ... (297 characters truncated) ...  out-of-production vehicles. All models come fully assembled and ready for display in the home or office. Most include a certificate of authenticity.'),
 ('590a952a0d5589b7c925844818a4648a', '1972 Alfa Romeo GTA', 'Classic Cars', '1:10', 'Motor City Art Classics', 'Features include: Turnable front wheels; steering function; detailed interior; detailed engine; opening hood; opening trunk; opening doors; and detailed chassis.', 'Attention car enthusiasts: Make your wildest car ownership dreams come true. Whether you are looking for classic muscle cars, dream sports cars or mo ... (437 characters truncated) ... cles. All models include a certificate of authenticity from their manufacturers and come fully assembled and ready for display in the home or office.'),
 ('504d67645cc129e92161e29d6f2fbd24', '1962 LanciaA Delta 16V', 'Classic Cars', '1:10', 'Second Gear Diecast', 'Features include: Turnable front wheels; steering function; detailed interior; detailed engine; opening hood; opening trunk; opening doors; and detailed chassis.', 'Attention car enthusiasts: Make your wildest car ownership dreams come true. Whether you are looking for classic muscle cars, dream sports cars or mo ... (437 characters truncated) ... cles. All models include a certificate of authenticity from their manufacturers and come fully assembled and ready for display in the home or office.'),
 ('ec93374992862f071a8ade8d69da3c64', '1968 Ford Mustang', 'Classic Cars', '1:12', 'Autoart Studio Design', 'Hood, doors and trunk all open to reveal highly detailed interior features. Steering wheel actually turns the front wheels. Color dark green.', 'Attention car enthusiasts: Make your wildest car ownership dreams come true. Whether you are looking for classic muscle cars, dream sports cars or mo ... (437 characters truncated) ... cles. All models include a certificate of authenticity from their manufacturers and come fully assembled and ready for display in the home or office.'),
 ('b3e8b79be1911a1f5f07d06c1a6f8d81', '2001 Ferrari Enzo', 'Classic Cars', '1:12', 'Second Gear Diecast', 'Turnable front wheels; steering function; detailed interior; detailed engine; opening hood; opening trunk; opening doors; and detailed chassis.', 'Attention car enthusiasts: Make your wildest car ownership dreams come true. Whether you are looking for classic muscle cars, dream sports cars or mo ... (437 characters truncated) ... cles. All models include a certificate of authenticity from their manufacturers and come fully assembled and ready for display in the home or office.'),
 ('3d79931afbc0f719d77cf2039dd2454b', '1958 Setra Bus', 'Trucks and Buses', '1:12', 'Welly Diecast Productions', 'Model features 30 windows, skylights & glare resistant glass, working steering system, original logos', 'The Truck and Bus models are realistic replicas of buses and specialized trucks produced from the early 1920s to present. The models range in size fr ... (124 characters truncated) ... n, diecast and plastic. All models include a certificate of authenticity from their manufacturers and are a perfect ornament for the home and office.'),
 ('a2cea97b93875997fdaf88fde1e3c2d8', '2002 Suzuki XREO', 'Motorcycles', '1:12', 'Unimax Art Galleries', 'Official logos and insignias, saddle bags located on side of motorcycle, detailed engine, working steering, working suspension, two leather seats, lu ... (82 characters truncated) ... paint with chrome accents, superior die-cast detail , rotating wheels , working kick stand, diecast metal with plastic parts and baked enamel finish.', 'Our motorcycles are state of the art replicas of classic as well as contemporary motorcycle legends such as Harley Davidson, Ducati and Vespa. Models ... (297 characters truncated) ...  out-of-production vehicles. All models come fully assembled and ready for display in the home or office. Most include a certificate of authenticity.')]

In [11]:
%sql SELECT * FROM classicmodels_star_schema.dim_dates LIMIT 10

 * postgresql+psycopg2://postgresuser:***@de-c4w4lab1-rds.c7462saomovv.us-east-1.rds.amazonaws.com:5432/postgres
10 rows affected.

[(datetime.date(2003, 1, 1), 3, 1.0, 1.0, 1, 1, 'January', 1, 2003),
 (datetime.date(2003, 1, 2), 4, 2.0, 2.0, 1, 1, 'January', 1, 2003),
 (datetime.date(2003, 1, 3), 5, 3.0, 3.0, 1, 1, 'January', 1, 2003),
 (datetime.date(2003, 1, 4), 6, 4.0, 4.0, 1, 1, 'January', 1, 2003),
 (datetime.date(2003, 1, 5), 7, 5.0, 5.0, 1, 1, 'January', 1, 2003),
 (datetime.date(2003, 1, 6), 1, 6.0, 6.0, 1, 1, 'January', 1, 2003),
 (datetime.date(2003, 1, 7), 2, 7.0, 7.0, 1, 1, 'January', 1, 2003),
 (datetime.date(2003, 1, 8), 3, 8.0, 8.0, 2, 1, 'January', 1, 2003),
 (datetime.date(2003, 1, 9), 4, 9.0, 9.0, 2, 1, 'January', 1, 2003),
 (datetime.date(2003, 1, 10), 5, 10.0, 10.0, 2, 1, 'January', 1, 2003)]

<a name='2'></a>
## 2 - Views with dbt

Let's review the star schema that you just created, which corresponds to the same schema you created in the first `dbt` lab.
![star_schema](images/star_schema.png)

Based on this schema, you are going to create some views and materialized views to serve your data by answering some business questions and generate a dashboard to visualize the results. First, let's review the definition of views and materialized views.

A **view** is a virtual table based on the result of a SQL query. It does not store the data physically; instead, it provides a way to look at the data from one or more tables. When you query a view, the underlying query is executed, and the result is returned. This means that you will always see up to date data from a view.

A **materialized view** is a database object that contains the results of a query and stores them physically. Unlike regular views, materialized views store the data, and therefore, do not need to query the base tables every time they are accessed. They need to be refreshed periodically to reflect changes in the underlying data. 

In this lab you are going to create 2 views and in order to compare views and materialized views, one of those views will be recreated as a materialized view. Check the following diagram corresponding to the two views that you are going to create:

![views](./images/views.png)

<a name='2.1'></a>
### 2.1 - Annual Sales per Office

The first business query that you will create should answer the question about the annual sales per office in terms of quantity of items sold and the total sales income received.

2.1.1. This is the query which should answer that question. Review the query and run it:

In [12]:
%%sql 
SELECT 
    DISTINCT fct.office_key
    , dof.city 
    , dof.state 
    , dof.country
    , dof.territory
    , SUM(fct.quantity_ordered) AS total_quantity 
    , sum(fct.quantity_ordered*fct.product_price) as total_price
    , EXTRACT(YEAR FROM fct.order_date) as year
FROM classicmodels_star_schema.fact_orders AS fct
JOIN classicmodels_star_schema.dim_offices AS dof ON dof.office_key=fct.office_key
GROUP BY fct.office_key
    , dof.city
    , dof.state
    , dof.country
    , dof.territory
    , EXTRACT(YEAR FROM fct.order_date)
ORDER BY fct.office_key ASC, year ASC

 * postgresql+psycopg2://postgresuser:***@de-c4w4lab1-rds.c7462saomovv.us-east-1.rds.amazonaws.com:5432/postgres
21 rows affected.

[('1679091c5a880faf6fb5e6087eb1b2dc', 'Sydney', 'NSW', 'Australia', 'APAC', 3529, Decimal('304949.11'), Decimal('2003')),
 ('1679091c5a880faf6fb5e6087eb1b2dc', 'Sydney', 'NSW', 'Australia', 'APAC', 5938, Decimal('542996.02'), Decimal('2004')),
 ('1679091c5a880faf6fb5e6087eb1b2dc', 'Sydney', 'NSW', 'Australia', 'APAC', 3411, Decimal('299231.22'), Decimal('2005')),
 ('8f14e45fceea167a5a36dedd4bea2543', 'London', None, 'UK', 'EMEA', 6017, Decimal('549551.94'), Decimal('2003')),
 ('8f14e45fceea167a5a36dedd4bea2543', 'London', None, 'UK', 'EMEA', 7659, Decimal('706014.52'), Decimal('2004')),
 ('8f14e45fceea167a5a36dedd4bea2543', 'London', None, 'UK', 'EMEA', 2015, Decimal('181384.24'), Decimal('2005')),
 ('a87ff679a2f3e71d9181a67b7542122c', 'Paris', None, 'France', 'EMEA', 10694, Decimal('969959.90'), Decimal('2003')),
 ('a87ff679a2f3e71d9181a67b7542122c', 'Paris', None, 'France', 'EMEA', 15971, Decimal('1465229.84'), Decimal('2004')),
 ('a87ff679a2f3e71d9181a67b7542122c', 'Paris', None, 'France', 'EMEA', 7222, Decimal('648571.84'), Decimal('2005')),
 ('c4ca4238a0b923820dcc509a6f75849b', 'San Francisco', 'CA', 'USA', 'NA', 6151, Decimal('532681.13'), Decimal('2003')),
 ('c4ca4238a0b923820dcc509a6f75849b', 'San Francisco', 'CA', 'USA', 'NA', 5697, Decimal('517408.62'), Decimal('2004')),
 ('c4ca4238a0b923820dcc509a6f75849b', 'San Francisco', 'CA', 'USA', 'NA', 4062, Decimal('378973.82'), Decimal('2005')),
 ('c81e728d9d4c2f636f067f89cc14862c', 'Boston', 'MA', 'USA', 'NA', 3298, Decimal('301781.38'), Decimal('2003')),
 ('c81e728d9d4c2f636f067f89cc14862c', 'Boston', 'MA', 'USA', 'NA', 5101, Decimal('467177.07'), Decimal('2004')),
 ('c81e728d9d4c2f636f067f89cc14862c', 'Boston', 'MA', 'USA', 'NA', 1389, Decimal('123580.17'), Decimal('2005')),
 ('e4da3b7fbbce2345d7772b0674a318d5', 'Tokyo', 'Chiyoda-Ku', 'Japan', 'Japan', 2851, Decimal('267249.40'), Decimal('2003')),
 ('e4da3b7fbbce2345d7772b0674a318d5', 'Tokyo', 'Chiyoda-Ku', 'Japan', 'Japan', 1692, Decimal('151761.45'), Decimal('2004')),
 ('e4da3b7fbbce2345d7772b0674a318d5', 'Tokyo', 'Chiyoda-Ku', 'Japan', 'Japan', 380, Decimal('38099.22'), Decimal('2005')),
 ('eccbc87e4b5ce2fe28308fd9f2a7baf3', 'NYC', 'NY', 'USA', 'NA', 3899, Decimal('391175.53'), Decimal('2003')),
 ('eccbc87e4b5ce2fe28308fd9f2a7baf3', 'NYC', 'NY', 'USA', 'NA', 7429, Decimal('665317.99'), Decimal('2004')),
 ('eccbc87e4b5ce2fe28308fd9f2a7baf3', 'NYC', 'NY', 'USA', 'NA', 1111, Decimal('101096.20'), Decimal('2005'))]

2.1.2. Create a new folder `analytical_views` located at `./classicmodels_modeling/models/`. Then in that folder create a new file `annual_sells_per_office_view.sql`. Copy the query from the previous step into that file (do not include the `%%sql` line).

2.1.3. At the beginning of this file right before your query, add the following jinja configuration that creates views instead of physical tables:

```
{{
config(
    materialized='view'
    )
}}
```

Don't be confused by the `materialized` key, in this case, this is a `dbt` [concept](https://docs.getdbt.com/docs/build/materializations) regarding the strategy on how the models will be persisted into the destination database. In this particular case, this specifies that the model should be materialized as a view (different from a materialized view) in the database.

2.1.4. Exchange the `classicmodels_star_schema` with the jinja templating string `{{var("star_schema")}}` (in two places). You will end with `{{var("star_schema")}}.<TABLE_NAME>` for each table in your query. This line will use jinja templating to take the value stored in the `star_schema` variable and will replace it with the value `classicmodels_star_schema` which is the database that hosts your new star schema data model.

Save changes to the file.

2.1.5. Create a new `schema.yml` file in the `./classicmodels_modeling/models/analytical_views/`folder. To set the schema for the view `annual_sells_per_office_view`, copy the following into the file and save changes:

```yml
version: 2

models:
  - name: annual_sells_per_office_view
    description: "Annual sells per office view"
    columns:
      - name: office_code        
      - name: city
      - name: state
      - name: country
      - name: territory
      - name: total_quantity
      - name: total_price
      - name: year
```

2.1.6. Open the `./classicmodels_modeling/dbt_project.yml` file, and at the bottom of the file add the following key:

```yml
analytical_views:
  +materialized: view
  +schema: star_schema
```

This also ensures that no physical tables are created but only materialized views and that they will be created in the schema named `star_schema`.

<a name='2.2'></a>
### 2.2 - Average Sales per Product Line

Now you've got a business question about the average sales (in terms of units and price) of each product line per month and year.

2.2.1. This is the query which should answer that question. Review the query and run it:

In [13]:
%%sql 
SELECT 
    dp.product_line
    , AVG(fct.quantity_ordered) AS avg_quantity 
    , AVG(fct.quantity_ordered*fct.product_price) AS avg_price
    , EXTRACT(MONTH FROM fct.order_date) AS month
    , EXTRACT(YEAR FROM fct.order_date) AS year 
FROM classicmodels_star_schema.fact_orders AS fct
JOIN classicmodels_star_schema.dim_products AS dp ON dp.product_key = fct.product_key
GROUP BY dp.product_line
    , EXTRACT(MONTH FROM fct.order_date)
    , EXTRACT(YEAR FROM fct.order_date)
ORDER BY
    dp.product_line ASC    
    , month ASC
    , year ASC
LIMIT 10

 * postgresql+psycopg2://postgresuser:***@de-c4w4lab1-rds.c7462saomovv.us-east-1.rds.amazonaws.com:5432/postgres
10 rows affected.

[('Classic Cars', Decimal('33.4000000000000000'), Decimal('3655.2330000000000000'), Decimal('1'), Decimal('2003')),
 ('Classic Cars', Decimal('35.7666666666666667'), Decimal('3892.1016666666666667'), Decimal('1'), Decimal('2004')),
 ('Classic Cars', Decimal('35.0789473684210526'), Decimal('3703.4450000000000000'), Decimal('1'), Decimal('2005')),
 ('Classic Cars', Decimal('40.0000000000000000'), Decimal('6313.6800000000000000'), Decimal('2'), Decimal('2003')),
 ('Classic Cars', Decimal('34.7878787878787879'), Decimal('3775.2809090909090909'), Decimal('2'), Decimal('2004')),
 ('Classic Cars', Decimal('35.5789473684210526'), Decimal('3913.0457894736842105'), Decimal('2'), Decimal('2005')),
 ('Classic Cars', Decimal('35.7307692307692308'), Decimal('3734.1607692307692308'), Decimal('3'), Decimal('2003')),
 ('Classic Cars', Decimal('40.8823529411764706'), Decimal('4802.2782352941176471'), Decimal('3'), Decimal('2004')),
 ('Classic Cars', Decimal('35.4814814814814815'), Decimal('3833.0974074074074074'), Decimal('3'), Decimal('2005')),
 ('Classic Cars', Decimal('38.7500000000000000'), Decimal('4795.4350000000000000'), Decimal('4'), Decimal('2003'))]

2.2.2. In the folder `./classicmodels_modeling/models/analytical_views/` create a new file `avg_sells_per_product_line_view.sql`. Copy the query from the previous step into that file (do not include the lines `%%sql` and `LIMIT 10`).

2.2.3. At the beginning of this file right before your query, add the following jinja configuration that creates views instead of physical tables:

```
{{
config(
    materialized='view'
    )
}}
```

2.2.4. Exchange the `classicmodels_star_schema` with the jinja templating string `{{var("star_schema")}}` (in two places). Save changes.

2.2.5. In the `./classicmodels_modeling/models/analytical_views/schema.yml` file add the schema for the view `avg_sells_per_product_line_view`:

```yml
  - name: avg_sells_per_product_line_view
    description: "Average sells per product lind view"
    columns:
      - name: product_line        
      - name: avg_quantity
      - name: avg_price
      - name: month
      - name: year
```

Save changes.

<a name='2.3'></a>
### 2.3 - Running Analytical Views

In order to run the analytical views that you just created.

2.3.1. Get back to your `dbt` project folder `classicmodels_modeling` run the analytical view:

*Note*: You may need to reactivate the environment:

```bash
source jupyterlab-venv/bin/activate
```

```bash
cd classicmodels_modeling
dbt run -s analytical_views
```

You should see an output similar to this one:

![dbt_create_views](./images/dbt_create_views.png)

2.3.2. The views will be created at the `classicmodels_star_schema` database, so you can use the following scripts to check that they were populated:

In [15]:
%%sql
SELECT COUNT(*) FROM classicmodels_star_schema.annual_sells_per_office_view;

 * postgresql+psycopg2://postgresuser:***@de-c4w4lab1-rds.c7462saomovv.us-east-1.rds.amazonaws.com:5432/postgres
1 rows affected.

[(21,)]

In [16]:
%%sql
SELECT * FROM classicmodels_star_schema.annual_sells_per_office_view order by year desc;

 * postgresql+psycopg2://postgresuser:***@de-c4w4lab1-rds.c7462saomovv.us-east-1.rds.amazonaws.com:5432/postgres
21 rows affected.

[('eccbc87e4b5ce2fe28308fd9f2a7baf3', 'NYC', 'NY', 'USA', 'NA', 1111, Decimal('101096.20'), Decimal('2005')),
 ('a87ff679a2f3e71d9181a67b7542122c', 'Paris', None, 'France', 'EMEA', 7222, Decimal('648571.84'), Decimal('2005')),
 ('c81e728d9d4c2f636f067f89cc14862c', 'Boston', 'MA', 'USA', 'NA', 1389, Decimal('123580.17'), Decimal('2005')),
 ('c4ca4238a0b923820dcc509a6f75849b', 'San Francisco', 'CA', 'USA', 'NA', 4062, Decimal('378973.82'), Decimal('2005')),
 ('1679091c5a880faf6fb5e6087eb1b2dc', 'Sydney', 'NSW', 'Australia', 'APAC', 3411, Decimal('299231.22'), Decimal('2005')),
 ('8f14e45fceea167a5a36dedd4bea2543', 'London', None, 'UK', 'EMEA', 2015, Decimal('181384.24'), Decimal('2005')),
 ('e4da3b7fbbce2345d7772b0674a318d5', 'Tokyo', 'Chiyoda-Ku', 'Japan', 'Japan', 380, Decimal('38099.22'), Decimal('2005')),
 ('c4ca4238a0b923820dcc509a6f75849b', 'San Francisco', 'CA', 'USA', 'NA', 5697, Decimal('517408.62'), Decimal('2004')),
 ('1679091c5a880faf6fb5e6087eb1b2dc', 'Sydney', 'NSW', 'Australia', 'APAC', 5938, Decimal('542996.02'), Decimal('2004')),
 ('8f14e45fceea167a5a36dedd4bea2543', 'London', None, 'UK', 'EMEA', 7659, Decimal('706014.52'), Decimal('2004')),
 ('a87ff679a2f3e71d9181a67b7542122c', 'Paris', None, 'France', 'EMEA', 15971, Decimal('1465229.84'), Decimal('2004')),
 ('c81e728d9d4c2f636f067f89cc14862c', 'Boston', 'MA', 'USA', 'NA', 5101, Decimal('467177.07'), Decimal('2004')),
 ('e4da3b7fbbce2345d7772b0674a318d5', 'Tokyo', 'Chiyoda-Ku', 'Japan', 'Japan', 1692, Decimal('151761.45'), Decimal('2004')),
 ('eccbc87e4b5ce2fe28308fd9f2a7baf3', 'NYC', 'NY', 'USA', 'NA', 7429, Decimal('665317.99'), Decimal('2004')),
 ('c4ca4238a0b923820dcc509a6f75849b', 'San Francisco', 'CA', 'USA', 'NA', 6151, Decimal('532681.13'), Decimal('2003')),
 ('e4da3b7fbbce2345d7772b0674a318d5', 'Tokyo', 'Chiyoda-Ku', 'Japan', 'Japan', 2851, Decimal('267249.40'), Decimal('2003')),
 ('8f14e45fceea167a5a36dedd4bea2543', 'London', None, 'UK', 'EMEA', 6017, Decimal('549551.94'), Decimal('2003')),
 ('a87ff679a2f3e71d9181a67b7542122c', 'Paris', None, 'France', 'EMEA', 10694, Decimal('969959.90'), Decimal('2003')),
 ('1679091c5a880faf6fb5e6087eb1b2dc', 'Sydney', 'NSW', 'Australia', 'APAC', 3529, Decimal('304949.11'), Decimal('2003')),
 ('c81e728d9d4c2f636f067f89cc14862c', 'Boston', 'MA', 'USA', 'NA', 3298, Decimal('301781.38'), Decimal('2003')),
 ('eccbc87e4b5ce2fe28308fd9f2a7baf3', 'NYC', 'NY', 'USA', 'NA', 3899, Decimal('391175.53'), Decimal('2003'))]

In [17]:
%%sql
SELECT COUNT(*) FROM classicmodels_star_schema.avg_sells_per_product_line_view;

 * postgresql+psycopg2://postgresuser:***@de-c4w4lab1-rds.c7462saomovv.us-east-1.rds.amazonaws.com:5432/postgres
1 rows affected.

[(10,)]

In [18]:
%%sql
SELECT * FROM classicmodels_star_schema.avg_sells_per_product_line_view order by year desc, month asc LIMIT 20;

 * postgresql+psycopg2://postgresuser:***@de-c4w4lab1-rds.c7462saomovv.us-east-1.rds.amazonaws.com:5432/postgres
10 rows affected.

[('Classic Cars', Decimal('35.0789473684210526'), Decimal('3703.4450000000000000'), Decimal('1'), Decimal('2005')),
 ('Classic Cars', Decimal('35.5789473684210526'), Decimal('3913.0457894736842105'), Decimal('2'), Decimal('2005')),
 ('Classic Cars', Decimal('35.4814814814814815'), Decimal('3833.0974074074074074'), Decimal('3'), Decimal('2005')),
 ('Classic Cars', Decimal('35.7666666666666667'), Decimal('3892.1016666666666667'), Decimal('1'), Decimal('2004')),
 ('Classic Cars', Decimal('34.7878787878787879'), Decimal('3775.2809090909090909'), Decimal('2'), Decimal('2004')),
 ('Classic Cars', Decimal('40.8823529411764706'), Decimal('4802.2782352941176471'), Decimal('3'), Decimal('2004')),
 ('Classic Cars', Decimal('33.4000000000000000'), Decimal('3655.2330000000000000'), Decimal('1'), Decimal('2003')),
 ('Classic Cars', Decimal('40.0000000000000000'), Decimal('6313.6800000000000000'), Decimal('2'), Decimal('2003')),
 ('Classic Cars', Decimal('35.7307692307692308'), Decimal('3734.1607692307692308'), Decimal('3'), Decimal('2003')),
 ('Classic Cars', Decimal('38.7500000000000000'), Decimal('4795.4350000000000000'), Decimal('4'), Decimal('2003'))]

<a name='2.4'></a>
### 2.4 - Creating Materialized View

Up to this moment, you have created views. Remember that those views are virtual tables that do not store data physically. Let's take the last view and create a materialized view so we can compare how these two materialization strategies work in a database.

2.4.1. Take the file `./classicmodels_modeling/models/analytical_views/avg_sells_per_product_line_view.sql`, copy it and rename as `avg_sells_per_product_line_mv.sql`. Open this new file and change the configuration to 

```
{{
    config(
        materialized='materialized_view',
        on_configuration_change = 'apply',
    )
}}
```

Take a look at the value of the `materialized` key. This value indicates that the materialization strategy will create an actual materialized view, which actually stores data physically. 

Save changes.

2.4.2. Open the `./classicmodels_modeling/models/analytical_views/schema.yml` file and add a schema named `avg_sells_per_product_line_mv` for this materialized view:

```yml
  - name: avg_sells_per_product_line_mv
    description: "Average sells per product line materialized view"
    columns:
      - name: product_line        
      - name: avg_quantity
      - name: avg_price
      - name: month
      - name: year
```

Save changes.

2.4.3. Finally, run again your `dbt` process with 

```
dbt run -s analytical_views
```

*Note:* Remember that in the `dbt_project` file, you set this configuration:

```
analytical_views:
    +materialized: view
    +schema: star_schema
```

Although this configuration specifies that the materialization strategy is a `view`, the configuration that you set at the `avg_sells_per_product_line_mv.sql` file overwrites this configuration to create a materialized view.

2.4.4. Run this command to check that the data has been successfully loaded into the materialized view:

In [19]:
%%sql
SELECT COUNT(*) FROM classicmodels_star_schema.avg_sells_per_product_line_mv;

 * postgresql+psycopg2://postgresuser:***@de-c4w4lab1-rds.c7462saomovv.us-east-1.rds.amazonaws.com:5432/postgres
1 rows affected.

[(10,)]

In [20]:
%%sql
SELECT * FROM classicmodels_star_schema.avg_sells_per_product_line_mv order by year desc, month asc LIMIT 20;

 * postgresql+psycopg2://postgresuser:***@de-c4w4lab1-rds.c7462saomovv.us-east-1.rds.amazonaws.com:5432/postgres
10 rows affected.

[('Classic Cars', Decimal('35.0789473684210526'), Decimal('3703.4450000000000000'), Decimal('1'), Decimal('2005')),
 ('Classic Cars', Decimal('35.5789473684210526'), Decimal('3913.0457894736842105'), Decimal('2'), Decimal('2005')),
 ('Classic Cars', Decimal('35.4814814814814815'), Decimal('3833.0974074074074074'), Decimal('3'), Decimal('2005')),
 ('Classic Cars', Decimal('35.7666666666666667'), Decimal('3892.1016666666666667'), Decimal('1'), Decimal('2004')),
 ('Classic Cars', Decimal('34.7878787878787879'), Decimal('3775.2809090909090909'), Decimal('2'), Decimal('2004')),
 ('Classic Cars', Decimal('40.8823529411764706'), Decimal('4802.2782352941176471'), Decimal('3'), Decimal('2004')),
 ('Classic Cars', Decimal('33.4000000000000000'), Decimal('3655.2330000000000000'), Decimal('1'), Decimal('2003')),
 ('Classic Cars', Decimal('40.0000000000000000'), Decimal('6313.6800000000000000'), Decimal('2'), Decimal('2003')),
 ('Classic Cars', Decimal('35.7307692307692308'), Decimal('3734.1607692307692308'), Decimal('3'), Decimal('2003')),
 ('Classic Cars', Decimal('38.7500000000000000'), Decimal('4795.4350000000000000'), Decimal('4'), Decimal('2003'))]

Now, it is the time to actually understand the difference between views and materialized views. Given that materialized views store data physically, they need to be refreshed when the underlying tables are updated. On the other hand, as views require the execution of the underlying query, they will always present up-to-date data.

2.4.5. Let's insert some mock data into the `fact_orders` table and see how it affects the views and materialized views. Execute the following cell to insert the data. Take a look at the dates, as all of them are in the year `2006` while the maximum year we have in our database currently is `2005`.

In [21]:
%%sql
SELECT MAX(EXTRACT(YEAR FROM fct.order_date))
FROM classicmodels_star_schema.fact_orders fct;

 * postgresql+psycopg2://postgresuser:***@de-c4w4lab1-rds.c7462saomovv.us-east-1.rds.amazonaws.com:5432/postgres
1 rows affected.

[(Decimal('2005'),)]

In [22]:
%%sql
INSERT INTO classicmodels_star_schema.fact_orders (fact_order_key, customer_key, employee_key, office_key, product_key, order_date, order_required_date, order_shipped_date, quantity_ordered, product_price) VALUES ('9eec411e690b55dafeb3ec3393aa6d57', '7d04bbbe5494ae9d2f5a76aa1c00fa2f', '4671aeaf49c792689533b00664a5c3ef', 'eccbc87e4b5ce2fe28308fd9f2a7baf3', '296efc252c7855537b5d9e6015bf42b8', '2006-06-01 00:00:00', '2006-07-01 00:00:00', '2006-06-15 00:00:00', 41, 83.79);
INSERT INTO classicmodels_star_schema.fact_orders (fact_order_key, customer_key, employee_key, office_key, product_key, order_date, order_required_date, order_shipped_date, quantity_ordered, product_price) VALUES ('f485cfdd94901e9e237dcc3f644f7edc', '7d04bbbe5494ae9d2f5a76aa1c00fa2f', '4671aeaf49c792689533b00664a5c3ef', 'eccbc87e4b5ce2fe28308fd9f2a7baf3', '8bff119b349bf271ef0684a15808ea18', '2006-06-01 00:00:00', '2006-07-01 00:00:00', '2006-06-15 00:00:00', 11, 50.32);
INSERT INTO classicmodels_star_schema.fact_orders (fact_order_key, customer_key, employee_key, office_key, product_key, order_date, order_required_date, order_shipped_date, quantity_ordered, product_price) VALUES ('7eecd924b84c4a03fcb69d5ec6df4670', '0f28b5d49b3020afeecd95b4009adf4c', 'd1ee59e20ad01cedc15f5118a7626099', 'a87ff679a2f3e71d9181a67b7542122c', '99733605e1ea651ec564248e05f77741', '2006-06-02 00:00:00', '2006-06-21 00:00:00', '2006-06-07 00:00:00', 18, 94.92 );

 * postgresql+psycopg2://postgresuser:***@de-c4w4lab1-rds.c7462saomovv.us-east-1.rds.amazonaws.com:5432/postgres
1 rows affected.
1 rows affected.
1 rows affected.

[]

2.4.6. Now that you have inserted the data, query again the views. Remember that `annual_sells_per_office_view` had 21 rows while `avg_sells_per_product_line_view` had 182 rows before the update.

In [23]:
%%sql
SELECT COUNT(*) FROM classicmodels_star_schema.annual_sells_per_office_view;

 * postgresql+psycopg2://postgresuser:***@de-c4w4lab1-rds.c7462saomovv.us-east-1.rds.amazonaws.com:5432/postgres
1 rows affected.

[(23,)]

In [24]:
%%sql
SELECT * FROM classicmodels_star_schema.annual_sells_per_office_view order by year desc;

 * postgresql+psycopg2://postgresuser:***@de-c4w4lab1-rds.c7462saomovv.us-east-1.rds.amazonaws.com:5432/postgres
23 rows affected.

[('eccbc87e4b5ce2fe28308fd9f2a7baf3', 'NYC', 'NY', 'USA', 'NA', 52, Decimal('3988.91'), Decimal('2006')),
 ('a87ff679a2f3e71d9181a67b7542122c', 'Paris', None, 'France', 'EMEA', 18, Decimal('1708.56'), Decimal('2006')),
 ('c81e728d9d4c2f636f067f89cc14862c', 'Boston', 'MA', 'USA', 'NA', 1389, Decimal('123580.17'), Decimal('2005')),
 ('c4ca4238a0b923820dcc509a6f75849b', 'San Francisco', 'CA', 'USA', 'NA', 4062, Decimal('378973.82'), Decimal('2005')),
 ('1679091c5a880faf6fb5e6087eb1b2dc', 'Sydney', 'NSW', 'Australia', 'APAC', 3411, Decimal('299231.22'), Decimal('2005')),
 ('8f14e45fceea167a5a36dedd4bea2543', 'London', None, 'UK', 'EMEA', 2015, Decimal('181384.24'), Decimal('2005')),
 ('eccbc87e4b5ce2fe28308fd9f2a7baf3', 'NYC', 'NY', 'USA', 'NA', 1111, Decimal('101096.20'), Decimal('2005')),
 ('a87ff679a2f3e71d9181a67b7542122c', 'Paris', None, 'France', 'EMEA', 7222, Decimal('648571.84'), Decimal('2005')),
 ('e4da3b7fbbce2345d7772b0674a318d5', 'Tokyo', 'Chiyoda-Ku', 'Japan', 'Japan', 380, Decimal('38099.22'), Decimal('2005')),
 ('c4ca4238a0b923820dcc509a6f75849b', 'San Francisco', 'CA', 'USA', 'NA', 5697, Decimal('517408.62'), Decimal('2004')),
 ('1679091c5a880faf6fb5e6087eb1b2dc', 'Sydney', 'NSW', 'Australia', 'APAC', 5938, Decimal('542996.02'), Decimal('2004')),
 ('8f14e45fceea167a5a36dedd4bea2543', 'London', None, 'UK', 'EMEA', 7659, Decimal('706014.52'), Decimal('2004')),
 ('a87ff679a2f3e71d9181a67b7542122c', 'Paris', None, 'France', 'EMEA', 15971, Decimal('1465229.84'), Decimal('2004')),
 ('c81e728d9d4c2f636f067f89cc14862c', 'Boston', 'MA', 'USA', 'NA', 5101, Decimal('467177.07'), Decimal('2004')),
 ('e4da3b7fbbce2345d7772b0674a318d5', 'Tokyo', 'Chiyoda-Ku', 'Japan', 'Japan', 1692, Decimal('151761.45'), Decimal('2004')),
 ('eccbc87e4b5ce2fe28308fd9f2a7baf3', 'NYC', 'NY', 'USA', 'NA', 7429, Decimal('665317.99'), Decimal('2004')),
 ('e4da3b7fbbce2345d7772b0674a318d5', 'Tokyo', 'Chiyoda-Ku', 'Japan', 'Japan', 2851, Decimal('267249.40'), Decimal('2003')),
 ('a87ff679a2f3e71d9181a67b7542122c', 'Paris', None, 'France', 'EMEA', 10694, Decimal('969959.90'), Decimal('2003')),
 ('c4ca4238a0b923820dcc509a6f75849b', 'San Francisco', 'CA', 'USA', 'NA', 6151, Decimal('532681.13'), Decimal('2003')),
 ('eccbc87e4b5ce2fe28308fd9f2a7baf3', 'NYC', 'NY', 'USA', 'NA', 3899, Decimal('391175.53'), Decimal('2003')),
 ('c81e728d9d4c2f636f067f89cc14862c', 'Boston', 'MA', 'USA', 'NA', 3298, Decimal('301781.38'), Decimal('2003')),
 ('8f14e45fceea167a5a36dedd4bea2543', 'London', None, 'UK', 'EMEA', 6017, Decimal('549551.94'), Decimal('2003')),
 ('1679091c5a880faf6fb5e6087eb1b2dc', 'Sydney', 'NSW', 'Australia', 'APAC', 3529, Decimal('304949.11'), Decimal('2003'))]

In [25]:
%%sql
SELECT COUNT(*) FROM classicmodels_star_schema.avg_sells_per_product_line_view;

 * postgresql+psycopg2://postgresuser:***@de-c4w4lab1-rds.c7462saomovv.us-east-1.rds.amazonaws.com:5432/postgres
1 rows affected.

[(10,)]

In [26]:
%%sql
SELECT * FROM classicmodels_star_schema.avg_sells_per_product_line_view order by year desc, month asc LIMIT 20;

 * postgresql+psycopg2://postgresuser:***@de-c4w4lab1-rds.c7462saomovv.us-east-1.rds.amazonaws.com:5432/postgres
10 rows affected.

[('Classic Cars', Decimal('35.0789473684210526'), Decimal('3703.4450000000000000'), Decimal('1'), Decimal('2005')),
 ('Classic Cars', Decimal('35.5789473684210526'), Decimal('3913.0457894736842105'), Decimal('2'), Decimal('2005')),
 ('Classic Cars', Decimal('35.4814814814814815'), Decimal('3833.0974074074074074'), Decimal('3'), Decimal('2005')),
 ('Classic Cars', Decimal('35.7666666666666667'), Decimal('3892.1016666666666667'), Decimal('1'), Decimal('2004')),
 ('Classic Cars', Decimal('34.7878787878787879'), Decimal('3775.2809090909090909'), Decimal('2'), Decimal('2004')),
 ('Classic Cars', Decimal('40.8823529411764706'), Decimal('4802.2782352941176471'), Decimal('3'), Decimal('2004')),
 ('Classic Cars', Decimal('33.4000000000000000'), Decimal('3655.2330000000000000'), Decimal('1'), Decimal('2003')),
 ('Classic Cars', Decimal('40.0000000000000000'), Decimal('6313.6800000000000000'), Decimal('2'), Decimal('2003')),
 ('Classic Cars', Decimal('35.7307692307692308'), Decimal('3734.1607692307692308'), Decimal('3'), Decimal('2003')),
 ('Classic Cars', Decimal('38.7500000000000000'), Decimal('4795.4350000000000000'), Decimal('4'), Decimal('2003'))]

2.4.7. Finally, let's query the materialized view. What can you see?

In [27]:
%%sql
SELECT COUNT(*) FROM classicmodels_star_schema.avg_sells_per_product_line_mv;

 * postgresql+psycopg2://postgresuser:***@de-c4w4lab1-rds.c7462saomovv.us-east-1.rds.amazonaws.com:5432/postgres
1 rows affected.

[(10,)]

In [28]:
%%sql
SELECT * FROM classicmodels_star_schema.avg_sells_per_product_line_mv order by year desc, month asc LIMIT 20;

 * postgresql+psycopg2://postgresuser:***@de-c4w4lab1-rds.c7462saomovv.us-east-1.rds.amazonaws.com:5432/postgres
10 rows affected.

[('Classic Cars', Decimal('35.0789473684210526'), Decimal('3703.4450000000000000'), Decimal('1'), Decimal('2005')),
 ('Classic Cars', Decimal('35.5789473684210526'), Decimal('3913.0457894736842105'), Decimal('2'), Decimal('2005')),
 ('Classic Cars', Decimal('35.4814814814814815'), Decimal('3833.0974074074074074'), Decimal('3'), Decimal('2005')),
 ('Classic Cars', Decimal('35.7666666666666667'), Decimal('3892.1016666666666667'), Decimal('1'), Decimal('2004')),
 ('Classic Cars', Decimal('34.7878787878787879'), Decimal('3775.2809090909090909'), Decimal('2'), Decimal('2004')),
 ('Classic Cars', Decimal('40.8823529411764706'), Decimal('4802.2782352941176471'), Decimal('3'), Decimal('2004')),
 ('Classic Cars', Decimal('33.4000000000000000'), Decimal('3655.2330000000000000'), Decimal('1'), Decimal('2003')),
 ('Classic Cars', Decimal('40.0000000000000000'), Decimal('6313.6800000000000000'), Decimal('2'), Decimal('2003')),
 ('Classic Cars', Decimal('35.7307692307692308'), Decimal('3734.1607692307692308'), Decimal('3'), Decimal('2003')),
 ('Classic Cars', Decimal('38.7500000000000000'), Decimal('4795.4350000000000000'), Decimal('4'), Decimal('2003'))]

When querying the materialized view, you can see that you get the same number of rows as before the update to the `fact_orders` table. In order to refresh this materialized view, you should run again the `dbt` model. Do it with the command

```
dbt run -s analytical_views
```

You will see that the materialized view has been refreshed:

![dbt_refresh_views](./images/dbt_refresh_views.png)

Finally, query again your materialized view to see the difference.

In [29]:
%%sql
SELECT COUNT(*) FROM classicmodels_star_schema.avg_sells_per_product_line_mv;

 * postgresql+psycopg2://postgresuser:***@de-c4w4lab1-rds.c7462saomovv.us-east-1.rds.amazonaws.com:5432/postgres
1 rows affected.

[(10,)]

In [30]:
%%sql
SELECT * FROM classicmodels_star_schema.avg_sells_per_product_line_mv order by year desc, month asc LIMIT 20;

 * postgresql+psycopg2://postgresuser:***@de-c4w4lab1-rds.c7462saomovv.us-east-1.rds.amazonaws.com:5432/postgres
10 rows affected.

[('Classic Cars', Decimal('35.0789473684210526'), Decimal('3703.4450000000000000'), Decimal('1'), Decimal('2005')),
 ('Classic Cars', Decimal('35.5789473684210526'), Decimal('3913.0457894736842105'), Decimal('2'), Decimal('2005')),
 ('Classic Cars', Decimal('35.4814814814814815'), Decimal('3833.0974074074074074'), Decimal('3'), Decimal('2005')),
 ('Classic Cars', Decimal('35.7666666666666667'), Decimal('3892.1016666666666667'), Decimal('1'), Decimal('2004')),
 ('Classic Cars', Decimal('34.7878787878787879'), Decimal('3775.2809090909090909'), Decimal('2'), Decimal('2004')),
 ('Classic Cars', Decimal('40.8823529411764706'), Decimal('4802.2782352941176471'), Decimal('3'), Decimal('2004')),
 ('Classic Cars', Decimal('33.4000000000000000'), Decimal('3655.2330000000000000'), Decimal('1'), Decimal('2003')),
 ('Classic Cars', Decimal('40.0000000000000000'), Decimal('6313.6800000000000000'), Decimal('2'), Decimal('2003')),
 ('Classic Cars', Decimal('35.7307692307692308'), Decimal('3734.1607692307692308'), Decimal('3'), Decimal('2003')),
 ('Classic Cars', Decimal('38.7500000000000000'), Decimal('4795.4350000000000000'), Decimal('4'), Decimal('2003'))]

With that exercise, you can notice the difference between a view and a materialized view. You may be wondering when you should use one or the other and you can use these paragraphs as a hint:

- Views: Use when you need a simple way to encapsulate complex queries, enhance security by exposing only certain data, or provide a simplified interface to the underlying tables. Ideal for frequently changing data where up-to-the-moment accuracy is essential.

- Materialized Views: Use when you need to improve performance for complex, resource-intensive queries. Ideal for reporting and data warehousing scenarios where data does not need to be up-to-the-second accurate, and where the performance gain from precomputed results outweighs the need for real-time data.

<a name='3'></a>
## 3 - Dashboard with Apache Superset

*Note*:Apache Superset takes around 15 to 20 minutes to load from the start of the lab, if you don't see the interface when entering the URL in a new tab, wait a while and refresh the page.

3.1. The EC2 instance has been set up for you to work with Apache Superset, the URL is among the CloudFormation Outputs. Access the Superset UI using the URL provided in the CloudFormation Outputs (take the value for the key `SupersetEndpoint`), you should see a login screen like this:

![superset_ui](images/superset_ui.png)

3.2. Login using the following credentials:

- user: `admin`
- password: `admin`

3.3. Configure the Postgres connection. Click on the dropdown **Settings** menu in the top right, and under the Data section select **Database Connections**. Click on the top right `+ Database` button, a new menu should appear to configure the new connection:

![superset_conf](images/superset_conf.png)

Select `PostgreSQL` and click Next. Fill out the details using the same connection parameters as the ones found in the `./scripts/profiles.yml`. The details for the connection are also can be printed out:

In [31]:
print(DBCONFIG)

{'type': 'postgres', 'threads': 1, 'host': 'de-c4w4lab1-rds.c7462saomovv.us-east-1.rds.amazonaws.com', 'port': 5432, 'dbname': 'postgres', 'schema': 'classicmodels', 'user': 'postgresuser', 'password': 'adminpwrd'}

After filling out the details, click on **Connect** button, this should have created a new connection in the `Data Connections` section. Click on **Finish** button.

3.4. Now, select the **Datasets** tab in the top header menu. You will be directed to a page with various example datasets. Click on `+ DATASET` button on the top right, a new screen will appear, you can use the connection that you just configured for Postgres, then select the `classicmodels_star_schema` and finally one of the views:

![superset_dataset](images/superset_dataset.png)

3.5. Click on the `CREATE DATASET AND CREATE CHART` button (in the bottom right), you will be directed to a new page to create a chart based on the dataset. You can select the type of chart and what variable is used for each dimension.

![superset_chart](images/superset_chart.png)

Once you are done with the chart, hit the **Save** button on the top right, it will ask you to give the chart a name and then save it. Create a chart for each view then create a new dashboard in the **Dashboards** section of the top navigational header, using the `+ Dashboard` button. Enter a name (in the top left part) for your dashboard and then drag and drop the charts you created earlier onto the dashboard canvas, Resize and arrange the charts as desired to create your dashboard layout and finally click Save to save your dashboard layout.

![superset_dashboard](images/superset_dashboard.png)

In this lab, you focused on data visualization using various types of views and a dashboard tool. Effective visual communication is crucial for presenting your findings and the results of your data pipelines to potential stakeholders. Although this task aligns more with the role of a data analyst, it is essential to understand their responsibilities and how we can supply them with the necessary data for their work.